### Importe de librerías

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
# Carga de datos
df_raw = pd.read_csv('../../data/raw/DATOS_CRUDOS.csv')

### Exploración de datos básica

In [13]:
# Exploración inicial
df_raw.head()

,ID_ESTACION,FECHA_REPORTE,HORA_REPORTE,TIPO_REPORTE,TEXTO_REPORTE,FECHA_INGRESO,CEDULA,FECHA_HORA_INSERCION,BANDERA
0,392,1900-01-01 23:59:59.000,1900-01-01 23:59:59.000,METAR,SKBQ NIL,2007-05-31 11:39:29.000,NaN,NaN,L
1,392,2006-07-20 00:00:00.000,2006-07-20 00:00:00.000,METAR,SKBQ 200000Z 03009KT 9999 TS FEW015CB SCT080 2...,2006-07-19 19:22:25.000,NaN,NaN,A
2,392,2006-07-20 01:00:00.000,2006-07-20 01:00:00.000,METAR,SKBQ 200100Z 25008KT 9999 TS FEW015CB SCT080 2...,2006-07-19 20:25:49.000,NaN,NaN,A
3,392,2006-07-20 06:00:00.000,2006-07-20 06:00:00.000,METAR,SKBQ 200600Z 29006KT 9999 FEW015 SCT080 26/23 ...,2006-07-20 01:24:29.000,NaN,NaN,A
4,392,2006-07-20 07:00:00.000,2006-07-20 07:00:00.000,METAR,SKBQ 200700Z 32006KT 9999 SCT012 26/24 A2984,2006-07-20 02:26:52.000,NaN,NaN,A

In [ ]:
# Información del DataFrame
df_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157635 entries, 0 to 157634
Data columns (total 9 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   ID_ESTACION           157635 non-null  int64
 1   FECHA_REPORTE         157635 non-null  object
 2   HORA_REPORTE          157635 non-null  object
 3   TIPO_REPORTE          157635 non-null  object
 4   TEXTO_REPORTE         157635 non-null  object
 5   FECHA_INGRESO         136961 non-null  object
 6   CEDULA                42 non-null      float64
 7   FECHA_HORA_INSERCION  126972 non-null  object
 8   BANDERA               157635 non-null  object
dtypes: float64(1), int64(1), object(7)
memory usage: 10.8+ MB

In [22]:
# Tamaño del DataFrame
df_raw.shape

(157635, 9)

In [21]:
# Tipos de datos
df_raw.dtypes

ID_ESTACION               int64
FECHA_REPORTE            object
HORA_REPORTE             object
TIPO_REPORTE             object
TEXTO_REPORTE            object
FECHA_INGRESO            object
CEDULA                  float64
FECHA_HORA_INSERCION     object
BANDERA                  object
dtype: object

In [15]:
# Estadísticas descriptivas
df_raw.describe()

       ID_ESTACION        CEDULA
count     157635.0  4.200000e+01
mean         392.0  8.231621e+07
std            0.0  4.943552e+06
min          392.0  8.001251e+07
25%          392.0  8.017344e+07
50%          392.0  8.017344e+07
75%          392.0  8.017344e+07
max          392.0  9.323700e+07

In [16]:
# Valores nulos por columna
null_counts = df_raw.isnull().sum()
print("Valores nulos por columna:\n", null_counts)

Valores nulos por columna:
 ID_ESTACION                  0
FECHA_REPORTE                0
HORA_REPORTE                 0
TIPO_REPORTE                 0
TEXTO_REPORTE                0
FECHA_INGRESO            20674
CEDULA                  157593
FECHA_HORA_INSERCION     30663
BANDERA                      0
dtype: int64

In [17]:
# Agrupación y conteo de valores únicos en una columna específica
column_name = 'ID_ESTACION'  # Reemplazar con el nombre real de la columna
value_counts = df_raw[column_name].value_counts()
print(f"Conteo de valores únicos en la columna {column_name}:\n", value_counts)

Conteo de valores únicos en la columna ID_ESTACION:
 ID_ESTACION
392    157635
Name: count, dtype: int64

In [ ]:
# Agrupación y conteo de valores únicos en una columna específica
column_name = 'TIPO_REPORTE'  # Reemplazar con el nombre real de la columna
value_counts = df_raw[column_name].value_counts()
print(f"Conteo de valores únicos en la columna {column_name}:\n", value_counts)

Conteo de valores únicos en la columna TIPO_REPORTE:
 TIPO_REPORTE
METAR    157635
Name: count, dtype: int64

In [19]:
# Agrupación y conteo de valores únicos en una columna específica
column_name = 'BANDERA'  # Reemplazar con el nombre real de la columna
value_counts = df_raw[column_name].value_counts()
print(f"Conteo de valores únicos en la columna {column_name}:\n", value_counts)

Conteo de valores únicos en la columna BANDERA:
 BANDERA
E     70550
L     45860
A     41217
AU        8
Name: count, dtype: int64

In [20]:
# Agrupación y conteo de valores únicos en una columna específica
column_name = 'CEDULA'  # Reemplazar con el nombre real de la columna
value_counts = df_raw[column_name].value_counts()
print(f"Conteo de valores únicos en la columna {column_name}:\n", value_counts)

Conteo de valores únicos en la columna CEDULA:
 CEDULA
80173436.0    26
80012512.0     9
93236999.0     7
Name: count, dtype: int64

In [28]:
# Variable objetivo
target_variable = 'TEXTO_REPORTE'
df_raw[target_variable].value_counts()

TEXTO_REPORTE
SKBQ 180800Z NIL                                                  25
SKBQ 240800Z NIL                                                  24
SKBQ 210700Z NIL                                                  24
SKBQ 150700Z NIL                                                  23
SKBQ 210800Z NIL                                                  22
                                                                  ..
SKBQ 071800Z 06009KT   9999   SCT015   SCT200 XX/XX   A2982        1
SKBQ 072000Z 04015KT   9999   FEW015   SCT200 XX/XX   A2978        1
SKBQ 072100Z 15013KT   9999   FEW015   BKN200 XX/XX   A2977        1
SKBQ 072200Z 04010KT   9999   FEW015   BKN200 XX/XX   A2979        1
SKBQ 051300Z 18004KT 6000 2900SW BCFG OVC004 26/25 Q1014 =         1
Name: count, Length: 153448, dtype: int64

In [ ]:
# Valores duplicados de la variable objetivo
df_raw[target_variable].value_counts()

TEXTO_REPORTE
SKBQ 180800Z NIL                                                                             25
SKBQ 240800Z NIL                                                                             24
SKBQ 210700Z NIL                                                                             24
SKBQ 150700Z NIL                                                                             23
SKBQ 210800Z NIL                                                                             22
                                                                                             ..
SKBQ 311100Z NIL                                                                              2
SKBQ 042100Z 33008KT  9999 8000W VCSH  SCT015CB  SCT070  29/26   A2984  RERA RMK/CB/SW/W=     2
SKBQ 042300Z 34005KT  9999  SCT015CB  BKN200  29/25   A2983  RMK CB/NE=                       2
SKBQ 071300Z NIL                                                                              2
SKBQ 110200Z 11012KT  CAVOK  27/24   A2974                                                    2
Name: count, Length: 1005, dtype: int64